Loading data.
Loaded data.
Total pictures:1464
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 512, 512, 3)  0                                            
__________________________________________________________________________________________________
sample_block_conv (Conv2D)      (None, 256, 256, 8)  224         input_1[0][0]                    
__________________________________________________________________________________________________
sample_block_BN (BatchNormaliza (None, 256, 256, 8)  32          sample_block_conv[0][0]          
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 8)  0           sample_block_BN[0][0]            
__________________________________________________________________________________________________
sample_block1_conv (Conv2D)     (None, 128, 128, 32) 2336        activation_1[0][0]               
__________________________________________________________________________________________________
sample_block1_BN (BatchNormaliz (None, 128, 128, 32) 128         sample_block1_conv[0][0]         
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 128, 32) 0           sample_block1_BN[0][0]           
__________________________________________________________________________________________________
sample_block2_conv (Conv2D)     (None, 64, 64, 64)   18496       activation_2[0][0]               
__________________________________________________________________________________________________
sample_block2_BN (BatchNormaliz (None, 64, 64, 64)   256         sample_block2_conv[0][0]         
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64, 64, 64)   0           sample_block2_BN[0][0]           
__________________________________________________________________________________________________
sample_block3_conv (Conv2D)     (None, 32, 32, 128)  73856       activation_3[0][0]               
__________________________________________________________________________________________________
sample_block3_BN (BatchNormaliz (None, 32, 32, 128)  512         sample_block3_conv[0][0]         
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 128)  0           sample_block3_BN[0][0]           
__________________________________________________________________________________________________
aspp1_depthwise (DepthwiseConv2 (None, 32, 32, 128)  1280        activation_4[0][0]               
__________________________________________________________________________________________________
aspp2_depthwise (DepthwiseConv2 (None, 32, 32, 128)  1280        activation_4[0][0]               
__________________________________________________________________________________________________
aspp3_depthwise (DepthwiseConv2 (None, 32, 32, 128)  1280        activation_4[0][0]               
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 128)    0           activation_4[0][0]               
__________________________________________________________________________________________________
aspp1_depthwise_BN (BatchNormal (None, 32, 32, 128)  512         aspp1_depthwise[0][0]            
__________________________________________________________________________________________________
aspp2_depthwise_BN (BatchNormal (None, 32, 32, 128)  512         aspp2_depthwise[0][0]            
__________________________________________________________________________________________________
aspp3_depthwise_BN (BatchNormal (None, 32, 32, 128)  512         aspp3_depthwise[0][0]            
__________________________________________________________________________________________________
image_pooling (Conv2D)          (None, 1, 1, 256)    33024       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 128)  0           aspp1_depthwise_BN[0][0]         
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 128)  0           aspp2_depthwise_BN[0][0]         
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 32, 32, 128)  0           aspp3_depthwise_BN[0][0]         
__________________________________________________________________________________________________
image_pooling_BN (BatchNormaliz (None, 1, 1, 256)    1024        image_pooling[0][0]              
__________________________________________________________________________________________________
aspp0 (Conv2D)                  (None, 32, 32, 256)  32768       activation_4[0][0]               
__________________________________________________________________________________________________
aspp1_pointwise (Conv2D)        (None, 32, 32, 256)  32768       activation_7[0][0]               
__________________________________________________________________________________________________
aspp2_pointwise (Conv2D)        (None, 32, 32, 256)  32768       activation_9[0][0]               
__________________________________________________________________________________________________
aspp3_pointwise (Conv2D)        (None, 32, 32, 256)  32768       activation_11[0][0]              
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 1, 1, 256)    0           image_pooling_BN[0][0]           
__________________________________________________________________________________________________
aspp0_BN (BatchNormalization)   (None, 32, 32, 256)  1024        aspp0[0][0]                      
__________________________________________________________________________________________________
aspp1_pointwise_BN (BatchNormal (None, 32, 32, 256)  1024        aspp1_pointwise[0][0]            
__________________________________________________________________________________________________
aspp2_pointwise_BN (BatchNormal (None, 32, 32, 256)  1024        aspp2_pointwise[0][0]            
__________________________________________________________________________________________________
aspp3_pointwise_BN (BatchNormal (None, 32, 32, 256)  1024        aspp3_pointwise[0][0]            
__________________________________________________________________________________________________
bilinear_upsampling_1 (Bilinear (None, 32, 32, 256)  0           activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 256)  0           aspp0_BN[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 256)  0           aspp1_pointwise_BN[0][0]         
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 32, 256)  0           aspp2_pointwise_BN[0][0]         
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 32, 32, 256)  0           aspp3_pointwise_BN[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 1280) 0           bilinear_upsampling_1[0][0]      
                                                                 activation_6[0][0]               
                                                                 activation_8[0][0]               
                                                                 activation_10[0][0]              
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
concatenate_layer (Conv2D)      (None, 32, 32, 256)  327936      concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_layer_BN (BatchNorm (None, 32, 32, 256)  1024        concatenate_layer[0][0]          
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 32, 32, 256)  0           concatenate_layer_BN[0][0]       
__________________________________________________________________________________________________
feature_projection0 (Conv2D)    (None, 128, 128, 48) 1584        activation_2[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 256)  0           activation_13[0][0]              
__________________________________________________________________________________________________
feature_projection_BN (BatchNor (None, 128, 128, 48) 192         feature_projection0[0][0]        
__________________________________________________________________________________________________
bilinear_upsampling_2 (Bilinear (None, 128, 128, 256 0           dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 128, 128, 48) 0           feature_projection_BN[0][0]      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 304 0           bilinear_upsampling_2[0][0]      
                                                                 activation_14[0][0]              
__________________________________________________________________________________________________
decoder_conv0_depthwise (Depthw (None, 128, 128, 304 3040        concatenate_2[0][0]              
__________________________________________________________________________________________________
decoder_conv0_depthwise_BN (Bat (None, 128, 128, 304 1216        decoder_conv0_depthwise[0][0]    
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 128, 128, 304 0           decoder_conv0_depthwise_BN[0][0] 
__________________________________________________________________________________________________
decoder_conv0_pointwise (Conv2D (None, 128, 128, 256 77824       activation_15[0][0]              
__________________________________________________________________________________________________
decoder_conv0_pointwise_BN (Bat (None, 128, 128, 256 1024        decoder_conv0_pointwise[0][0]    
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128, 256 0           decoder_conv0_pointwise_BN[0][0] 
__________________________________________________________________________________________________
decoder_conv1_depthwise (Depthw (None, 128, 128, 256 2560        activation_16[0][0]              
__________________________________________________________________________________________________
decoder_conv1_depthwise_BN (Bat (None, 128, 128, 256 1024        decoder_conv1_depthwise[0][0]    
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 128, 128, 256 0           decoder_conv1_depthwise_BN[0][0] 
__________________________________________________________________________________________________
decoder_conv1_pointwise (Conv2D (None, 128, 128, 256 65536       activation_17[0][0]              
__________________________________________________________________________________________________
decoder_conv1_pointwise_BN (Bat (None, 128, 128, 256 1024        decoder_conv1_pointwise[0][0]    
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 128, 128, 256 0           decoder_conv1_pointwise_BN[0][0] 
__________________________________________________________________________________________________
semantic (Conv2D)               (None, 128, 128, 21) 5397        activation_18[0][0]              
__________________________________________________________________________________________________
bilinear_upsampling_3 (Bilinear (None, 512, 512, 21) 0           semantic[0][0]                   
==================================================================================================
Total params: 759,813
Trainable params: 753,269
Non-trainable params: 6,544
__________________________________________________________________________________________________
